monkeyboard/Wiegand-to-HID-Keyboard-Converter-for-MonkeyBUS-PIC18/Firmware/Keyboard.c
    // Configure the device PLL to obtain 60 MIPS operation. The crystal
    // frequency is 8MHz. Divide 8MHz by 2, multiply by 60 and divide by
    // 2. This results in Fosc of 120MHz. The CPU clock frequency is
    // Fcy = Fosc/2 = 60MHz. Wait for the Primary PLL to lock and then
    // configure the auxilliary PLL to provide 48MHz needed for USB 
    // Operation.

	PLLFBD = 58;				/* M  = 60	*/
	CLKDIVbits.PLLPOST = 0;		/* N1 = 2	*/
	CLKDIVbits.PLLPRE = 0;		/* N2 = 2	*/
	OSCTUN = 0;			

    /*	Initiate Clock Switch to Primary
     *	Oscillator with PLL (NOSC= 0x3)*/
	
    __builtin_write_OSCCONH(0x03);		
	__builtin_write_OSCCONL(0x01);
	
	while (OSCCONbits.COSC != 0x3);       

    // Configuring the auxiliary PLL, since the primary
    // oscillator provides the source clock to the auxiliary
    // PLL, the auxiliary oscillator is disabled. Note that
    // the AUX PLL is enabled. The input 8MHz clock is divided
    // by 2, multiplied by 24 and then divided by 2. Wait till 
    // the AUX PLL locks.

    ACLKCON3 = 0x24C1;   
    ACLKDIV3 = 0x7;
    
    ACLKCON3bits.ENAPLL = 1;
    while(ACLKCON3bits.APLLCK != 1); 

    #endif


//	The USB specifications require that USB peripheral devices must never source
//	current onto the Vbus pin.  Additionally, USB peripherals should not source
//	current on D+ or D- when the host/hub is not actively powering the Vbus line.
//	When designing a self powered (as opposed to bus powered) USB peripheral
//	device, the firmware should make sure not to turn on the USB module and D+
//	or D- pull up resistor unless Vbus is actively powered.  Therefore, the
//	firmware needs some means to detect when Vbus is being powered by the host.
//	A 5V tolerant I/O pin can be connected to Vbus (through a resistor), and
// 	can be used to detect when Vbus is high (host actively powering), or low
//	(host is shut down or otherwise not supplying power).  The USB firmware
// 	can then periodically poll this I/O pin to know when it is okay to turn on
//	the USB module/D+/D- pull up resistor.  When designing a purely bus powered
//	peripheral device, it is not possible to source current on D+ or D- when the
//	host is not actively providing power on Vbus. Therefore, implementing this
//	bus sense feature is optional.  This firmware can be made to use this bus
//	sense feature by making sure "USE_USB_BUS_SENSE_IO" has been defined in the
//	HardwareProfile.h file.    
    #if defined(USE_USB_BUS_SENSE_IO)
    tris_usb_bus_sense = INPUT_PIN; // See HardwareProfile.h
    #endif
    
//	If the host PC sends a GetStatus (device) request, the firmware must respond
//	and let the host know if the USB peripheral device is currently bus powered
//	or self powered.  See chapter 9 in the official USB specifications for details
//	regarding this request.  If the peripheral device is capable of being both
//	self and bus powered, it should not return a hard coded value for this request.
//	Instead, firmware should check if it is currently self or bus powered, and
//	respond accordingly.  If the hardware has been configured like demonstrated
//	on the PICDEM FS USB Demo Board, an I/O pin can be polled to determine the
//	currently selected power source.  On the PICDEM FS USB Demo Board, "RA2" 
//	is used for	this purpose.  If using this feature, make sure "USE_SELF_POWER_SENSE_IO"
//	has been defined in HardwareProfile.h, and that an appropriate I/O pin has been mapped
//	to it in HardwareProfile.h.
    #if defined(USE_SELF_POWER_SENSE_IO)
    tris_self_power = INPUT_PIN;	// See HardwareProfile.h
    #endif
    
    UserInit();

    USBDeviceInit();	//usb_device.c.  Initializes USB module SFRs and firmware
    					//variables to known states.
}//end InitializeSystem



/******************************************************************************
 * Function:        void UserInit(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine should take care of all of the demo code
 *                  initialization that is required.
 *
 * Note:            
 *
 *****************************************************************************/
void UserInit(void)
{
	_sysTick = 0;
	_lastWiegand = 0;
	_cardTemp = 0;
	_bitCount = 0;
    //Initialize all of the LED pins
    mInitAllLEDs();
    mLED_2_On();
	//Set input to digital
	mClrAnsel();
	//Initialise Wiegand pins
	mTwiPinInit();
	mTwiPinConf();
	//Clear INT0 interrupt flag
	mClrInt0F();
	//Clear INT2 interrupt flag
	mClrInt2F();
	//Set Timer0
	mTimer0Con();
	mClrTm0Init();
  	mReloadTm0();
    //INTCONbits.TMR0IE = 1;
    mEnInt();   
    //initialize the variable holding the handle for the last
    // transmission

    lastINTransmission = 0;
    lastOUTTransmission = 0;

}//end UserInit

/********************************************************************
 * Function:        void CheckAscii (char *ch)
 *
 * PreCondition:    None
 *
 * Input:           char pointer
 *
 * Output:          Modified input
 *
 * Side Effects:    None
 *
 * Overview:        Change ascii to keyboard input
 *
 * Note:            None
 *******************************************************************/
void CheckAscii (char *ch)
{
	if ((*ch > 96) && (*ch < 123))
	{
		*ch -= 87;
		
	}
	else if ((*ch > 48) && (*ch < 58))
	{
		*ch -= 48;
	}
	else if (*ch == '0')
	{
		*ch = 0;
	}
	else if (*ch == '\r')
	{
		*ch = 36;
		mLED_4_Off();
	}
	else if (*ch == ' ')
	{
		*ch = 37;
	}
	else if (*ch == '[')
	{
		*ch = 38;
	}
	else if (*ch == ']')
	{
		*ch = 39;
	}
	
}//end CheckAscii

/********************************************************************
 * Function:        void SendChar (char *ch)
 *
 * PreCondition:    None
 *
 * Input:           char pointer
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Send character as keyboard output
 *
 * Note:            None
 *******************************************************************/
void SendChar (char *ch)
{
	CheckAscii (ch);
	Keyboard(ch);
}//end SendChar

