monkeyboard/Wiegand-to-HID-Keyboard-Converter-for-MonkeyBUS-PIC18/Firmware/Keyboard.c
/********************************************************************
 * Function:        unsigned long GetCardId (unsigned long code)
 *
 * PreCondition:    None
 *
 * Input:           Raw Wiegand code
 *
 * Output:          Card ID
 *
 * Side Effects:    None
 *
 * Overview:        Find card ID from 26 bit Wiegand
 *
 * Note:            None
 *******************************************************************/
unsigned long GetCardId (unsigned long code)
{
	unsigned long cardId;

	cardId = code & 0x1FFFF;
	cardId = cardId >> 1;		

	return cardId;
}//end GetCardId

/********************************************************************
 * Function:        unsigned long GetFc (unsigned long code)
 *
 * PreCondition:    None
 *
 * Input:           Raw Wiegand code
 *
 * Output:          Facility code
 *
 * Side Effects:    None
 *
 * Overview:        Find facility code from 26 bit Wiegand
 *
 * Note:            None
 *******************************************************************/
unsigned long GetFc (unsigned long code)
{
	unsigned long fc;
	char i;

	fc = code & 0x3FFF000;
	fc = fc >> 17;
	if (fc % 2)
	{
		fc &= 0x1ff;
	}
	else
	{
		fc &= 0xff;
	}

	return fc;
}//end GetFc

/********************************************************************
 * Function:        void DoWiegandCoversion (void)
 *	
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Converts Wiegand output into card number and
 *                  facility code.
 *
 * Note:            0x<Wiegand code> [facility code] <card ID>
 *******************************************************************/

void DoWiegandCoversion (void)
{
	char buff[MAXSIZE], i;
	char hd [] = "0x";
	char len = strlen (hd);
	char *c;
	unsigned long  cardId, fc;
	if (((_bitCount) && (_sysTick - _lastWiegand) > 50))
	{
		//Make sure we get at least 26 bit Wiegand
		if (_bitCount > 25)
		{
			_gotCard = _cardTemp;
			//ignore the end bit
			_gotCard = _gotCard >> 1;
			
		}
		_cardTemp = 0;	
		_bitCount = 0;		
	}

	if (_gotCard)
	{
		cardId = GetCardId (_gotCard);
		fc = GetFc (_gotCard);		
		for (i = 0; i < len; i++)
		{
			SendChar (hd +i);
		}
		memset (buff, 0, MAXSIZE);

		for (i = 0; i < 7;)
		{
			buff[i] =   (_gotCard & 0x0f);
			buff[i+1] = (_gotCard >> 4) & 0x0f;
			_gotCard >>= 8;
			i += 2;
		}

		for (i = 7; i > -1; i --)
		{	
    		Keyboard(buff + i);
		}


		*buff = ' ';		// space
		SendChar (buff);
		
		*buff = '[';		// space
		SendChar (buff);

		//break code down to dec
		buff[2] = fc / 100;
		buff[1] = fc % 100;
		buff[1] = buff[1] / 10;
		buff[0] = fc%10;
		for (i = 2; i > -1; i --)
		{	
    		Keyboard(buff + i);
		}
		*buff = ']';		// space
		SendChar (buff);

		*buff = ' ';		// space
		SendChar (buff);

		//cardId= 12345;
		for (i = 5; i >= 0; i --)
		{
			buff[i] = cardId % 10;
			cardId /= 10;
		}

		for (i = 0; i < 6; i ++)
		{
			Keyboard(buff + i);
		}
		*buff = '\r';		// space
		SendChar (buff);
		_gotCard = 0;
	
	}
}//end DoWiegandCoversion

/********************************************************************
 * Function:        void ProcessIO(void)
 *	
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This function is a place holder for other user
 *                  routines. It is a mixture of both USB and
 *                  non-USB tasks.
 *
 * Note:            None
 *******************************************************************/
void ProcessIO(void)
{   
	DoWiegandCoversion ();
    // User Application USB tasks
    if((USBDeviceState < CONFIGURED_STATE)||(USBSuspendControl==1)) return;  
     
}//end ProcessIO

/********************************************************************
 * Function:        void Keyboard(char *buff)
 *	
 * PreCondition:    None
 *
 * Input:           Pointer to buffer
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This function send what is in the buffer to USB
 *                  non-USB tasks.
 *
 * Note:            None
 *******************************************************************/
void Keyboard(char *buff)
{
	
	//CheckAscii (buff);
	//Load the HID buffer
	hid_report_in[0] = 0;
	hid_report_in[1] = 0;
	hid_report_in[2] = keyLookup [*buff];
	hid_report_in[3] = 0;
	hid_report_in[4] = 0;
	hid_report_in[5] = 0;
	hid_report_in[6] = 0;
	hid_report_in[7] = 0;
	//Send the 8 byte packet over USB to the host.
	lastINTransmission = HIDTxPacket(HID_EP, (BYTE*)hid_report_in, 0x08);
	USBDeviceTasks();
	//Wait until Tx finish
	while (HIDTxHandleBusy(lastINTransmission));

	//No repeats
	hid_report_in[0] = 0;
	hid_report_in[1] = 0;
	hid_report_in[2] = 0;   //Indicate no character pressed
	hid_report_in[3] = 0;
	hid_report_in[4] = 0;
	hid_report_in[5] = 0;
	hid_report_in[6] = 0;
	hid_report_in[7] = 0;
	//Send the 8 byte packet over USB to the host.
	lastINTransmission = HIDTxPacket(HID_EP, (BYTE*)hid_report_in, 0x08);
	USBDeviceTasks();
	while (HIDTxHandleBusy(lastINTransmission));
    
}//end keyboard()



/******************************************************************************
 * Function:        BOOL Switch2IsPressed(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          TRUE - pressed, FALSE - not pressed
 *
 * Side Effects:    None
 *
 * Overview:        Indicates if the switch is pressed.  
 *
 * Note:            
 *
 *****************************************************************************/
BOOL Switch2IsPressed(void)
{
    if(sw2 != old_sw2)
    {
        old_sw2 = sw2;                  // Save new value
        if(sw2 == 0)                    // If pressed
            return TRUE;                // Was pressed
    }//end if
    return FALSE;                       // Was not pressed
}//end Switch2IsPressed

/******************************************************************************
 * Function:        BOOL Switch3IsPressed(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          TRUE - pressed, FALSE - not pressed
 *
 * Side Effects:    None
 *
 * Overview:        Indicates if the switch is pressed.  
 *
 * Note:            
 *
 *****************************************************************************/
BOOL Switch3IsPressed(void)
{
    if(sw3 != old_sw3)
    {
        old_sw3 = sw3;                  // Save new value
        if(sw3 == 0)                    // If pressed
            return TRUE;                // Was pressed
    }//end if
    return FALSE;                       // Was not pressed
}//end Switch3IsPressed

